package object;

import java.util.Random;
import java.util.Scanner;

import javazoom.jl.player.MP3Player;
import main.Sleep;
import screen.Field;

//Player class, 상태 정보를 가지므로 State 상속
public class JJangGu extends State {

	Random rd = new Random();
	private int readNum;
	private char read;
	private String order;
	private Scanner sc = new Scanner(System.in);
	private boolean checkShop = false;
	Sleep time = new Sleep();

	protected String skill; // 추후 스킬 레이블 추가
	protected int hpPotion = 5;
	int coin;

	// 생성자, 기본 정보 초기화
	public JJangGu() {
		this.name = "짱구";
		x = 0;
		y = 0;
		setImage(" Ü ");
		maxHp = 100;
		hp = maxHp;
		sp = 3;
		minAtk = 10;
		maxAtk = 12;
		coin = 10000;

	}

	// 필드 이동, 적을 만나면 true 반환
	private boolean move(Field f, int moveX, int moveY) {
		this.moveX = x + moveX;
		this.moveY = y + moveY;
		if (moveY == -1)
			setImage(" Ü ");
		if (moveX == -1)
			setImage(" Ü ");
		if (moveY == 1)
			setImage(" Ü ");
		if (moveX == 1)
			setImage(" Ü ");

		if (this.moveX < f.getW() && this.moveX >= 0 && this.moveY < f.getH() && this.moveY >= 0)

			if (f.checkNullObData(this.moveX, this.moveY, 0)) {
				f.resetOb(this);
				x = this.moveX;
				y = this.moveY;
				f.sortObData(x, y);
				f.sortObData(x - moveX, y - moveY);
			} else if (f.getObData(this.moveX, this.moveY, 0) instanceof Shop) {
				readNum = 0;
				checkShop = true;
			} else if (f.getObData(this.moveX, this.moveY, 0) instanceof Enemi) {
				readNum = 0;
				return true;
			} else if (!f.getObData(this.moveX, this.moveY, 0).collider) {
				f.resetOb(this);
				x = this.moveX;
				y = this.moveY;
				f.sortObData(x, y);
				f.sortObData(x - moveX, y - moveY);
			}
		return false;
	}

	// 필드 이동 명령어 받기
	public void setMoveOrder() {
		System.out.println("\t\t\t"+"'w' : 위로 한칸 움직인다.");
		System.out.println("\t\t\t"+"'s' : 아래로 한칸 움직인다.");
		System.out.println("\t\t\t"+"'a' : 왼쪽으로 한칸 움직인다.");
		System.out.println("\t\t\t"+"'d' : 오른쪽으로 한칸 움직인다.");
		System.out.print("\t\t\t"+"명령어를 입력하세요 (총 " + sp + "회 입력 가능): ");
		order = sc.nextLine();
	}

	// 받은 명령어를 하나씩 읽음, 성공적으로 읽으면 true 반환
	public boolean readMoveOrder() {
		if (readNum < sp && readNum < order.length()) {
			read = order.charAt(readNum);
			readNum++;
			return true;
		} else {
			readNum = 0;
			return false;
		}
	}

	// 필드 이동방향 결정
	public boolean runMoveOrder(Field f) {
		switch (read) {
		case 'w':
			return move(f, 0, -1);
		case 'a':
			return move(f, -1, 0);
		case 's':
			return move(f, 0, 1);
		case 'd':
			return move(f, 1, 0);
		default:
			return false;
		}
	}

	// stage 이동시 초기화
	public void reset(int x, int y) {
		this.x = x;
		this.y = y;
		setImage(" Ü ");
		checkShop = false;
		readNum = 0;
	}

	public void printSa() {
		System.out.println();
		System.out.println();
		System.out.println();
		System.out.println();
		System.out.println();
		System.out.println("\t ██████╗  █████╗ ███╗   ███╗███████╗     ██████╗ ██╗   ██╗███████╗██████╗ ");
		System.out.println("\t██╔════╝ ██╔══██╗████╗ ████║██╔════╝    ██╔═══██╗██║   ██║██╔════╝██╔══██╗");
		System.out.println("\t██║  ███╗███████║██╔████╔██║█████╗      ██║   ██║██║   ██║█████╗  ██████╔╝");
		System.out.println("\t██║   ██║██╔══██║██║╚██╔╝██║██╔══╝      ██║   ██║╚██╗ ██╔╝██╔══╝  ██╔══██╗");
		System.out.println("\t╚██████╔╝██║  ██║██║ ╚═╝ ██║███████╗    ╚██████╔╝ ╚████╔╝ ███████╗██║  ██║");
		System.out.println("\t ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝     ╚═════╝   ╚═══╝  ╚══════╝╚═╝  ╚═╝");
		System.out.println();
		System.out.println();
		System.out.println();
		System.out.println("⠀⠀⠀⠀⠀⠀                         ⠀⠀⠀⠀⢀⣀⣀⣤⣤⣤⣤⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠤⣖⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⢤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⢖⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⡣⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠋⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠹⣿⣿⣿⣿⣹⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣾⣿⣿⣿⣿⣏⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢷⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⠗⠒⢲⣷⠒⢢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡼⣿⣿⣿⣿⢟⣫⠗⠚⠉⠀⠀⠀⠀⠀⠀⠀  ⠉⢛⣻⣿⣿⣛⣛⣛⣿⢿⣿⡞ ⠎⠉⡰ ⢰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢣⠻⢿⣛⣷⣋⡀⠀⣀⣀⠤⠒⠲⠤⠚⠑⠒⠋⠉⠈⠉⠉⠉⠉⠉⠉⠈⠑⢮⡇ ⡇⡀⠀⢰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢨⠟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⠀⢧⠀⢳⢀⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡸ ⠀⢠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⡀  ⢸ ⢧⣀⣼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⡰⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⡇⠀ ⢸ ⠈⢇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡴⠋⠀⣀⡤⠖⠒⠒⠋⠉⠉⠉⠒⠒⠒⢄⡀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⢰⠀⠀⠀⡇⠀⠀⠀⢹⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡞⣠⠔⠊⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠑⢄ ⠀⠀⠀  ⠀⠀⠀⠀⡇⠀⠀⡇⠀  ⢼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠏⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⡀  ⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⡇⠀⠀ ⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠜⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⠀⠀⠀⠀⠀⠀  ⠀⡇⠀⠀⡇⠀ ⡼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠇⡀⠀⠀⠀⠀⠀  ⡇⠀⠀⣇⣠⠞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠲⡀⠀⠀⠀⠀⡸  ⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢆⠀⠀⠀⣇⣀⣠⢇⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡰⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢆⠀⠀⡇⢀⣀⣉⣻⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⡆ ⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢢⠞⠉⠑⠂⠤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⣁⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠁⠀⠀⠀⠀⠀⠀⠉⠒⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡰⠁⠀⠀⠀⠀⠀⠀⣠⠖⢍⡀⠈⠢⡀⠀⠀⠀⠀⠀⣀⣤⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀ ⠀⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢇⠀⠀⠀⣀⠤⠤⢫⠀⣠⠴⠒⠫⡒⡌⠦⠤⠴⠒⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⢄⠘⠁⠀⠀⠘⢄⡇⠀⠀⠀⠘⢴⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⢀⡤⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠢⣤⣀⣀⣇⠈⠑⢤⡖⢒⣪⠭⠙⢢⡀⠀⠀⢀⣀⣀⣠⠤⠤⠤⠔⠊⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡇⣀⡤⠖⠛⣴⢫⠚⠁⠀⣀⡠⠊⠈⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⠟⠊⠁⠀⣠⠞⠘⠧⠤⠒⠊⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡏⠀⢀⣠⠔⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀");
		System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠀⠀      ⠀");
		System.out.println("\n\n");
	}		

	public void skill(State object) {

		int cnt = rd.nextInt(3);
		MP3Player mp3 = new MP3Player();

		if (cnt == 0) {
			System.out.println("  달팽이 변신!!!!");
			time.sleep(2000);
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⢀⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⣠⣴⠾⠛⠉⠉⠉⠉⠛⠷⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀   ⣴⠾⠋⠁⠀⠀⠀⠀⠀⠀ ⠀⠀⠈⠛⢷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⣰⡿⠋⠀⠀⠀⠰⣶⣄⠀⠀⠀⠀⠀  ⠀⡈⢻⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⣴⡿⠀⠀⠀⠀⠀⠀⠀⠀⠹⣷⡀⠀⠀⠀⠀  ⠁⠀⢹⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⢠⣾⠋⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣷⡀⠀⠀⠀⠀ ⠀⠀⢻⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⢠⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣷⡀⠀⠀⠀⠀⠀⠘⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⢀⣾⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣷⠀⠀⠀⣀⣴⠶⢾⡇⠀⠀⢀⣴⠶⢶⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⠀⢢⡟⢁⣴⠾⢧⠀⠀⣸⠃⣰⡿⠻⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⠀⢸⡇⢸⡟⠀⣾⡆⠀⢻⡆⢿⡅⢈⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⢀⣠⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⣿⡇⠘⣧⠈⠻⣶⣿⠀⠀⠈⣿⠈⢻⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⠀⠀⠀⠀⠀⢠⣾⠟⠉⠙⢿⣄⠀⠀⠀⠀⠀⠀⣿⡧⠀⢹⠀⢰⡿⢸⡇⠀⠀⣿⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⢀⣿⠏⠀⠀⠄⠀⢿⣆⠀⠀⠀⠀⠀⣿⡇⢠⣿⠀⣾⠁⠸⣧⠀⢀⡿⢸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⣸⡟⠀⠀⠀⠀⠀⠊⢿⡄⠀⠀⠀⠀⣿⡇⣾⠃⠰⣿⠀⢸⣿⠀⣼⡇⢼⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⢀⣿⡇⠀⠀⠀⠀⠀⠈⠸⣿⠀⠀⠀⠀⠈⣸⡇⠀⠀⣿⣤⣼⣧⣤⣿⠅⢸⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠂⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⣿⠇⠀⠀⠙⢉⣤⣴⠶⠶⢶⣿⣿⣧⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⣼⡏⠀⠀⡀⣄⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⣿⢠⣴⣶⣄⣾⣿⣿⡶⠶⢾⣿⣿⣇⠙⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⣿⡇⠀⠀⠐⢻⡇⠀⠀⠀⣿⡇⠀⠀⢀⢠⡟⠸⣿⣿⣿⣿⣿⡟⠀⠀⠘⢿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣟⠀⠀⠀⢿⡇⠀⠀⠀⢹⣿⠀⠀⠀⣿⡇⠀⢀⣴⠟⠀⣤⠋⢻⣿⣿⣿⡀⠀⠀⠀⢀⣽⠿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡄⠀⠀⢸⣇⠀⠀⠀⣾⡟⠀⠀⠀⣿⡇⠀⣼⠏⢀⣼⠃⢠⡾⠋⠀⠈⠻⣦⠀⢰⡟⠁⠀⠀⢻⣿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⠚⠛⢿⡇⠀⠀⠸⣿⡄⠀⢰⡿⠁⠀⠀⠠⣿⡇⢠⡟⠀⣸⠃⢠⡿⠁⠀⣀⣤⣄⣹⡇⣿⢁⣤⣤⡀⠈⣷⠙⢷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣧⣀⠀⠘⣿⡀⠀⠀⠙⠿⣶⠿⠁⠀⠀⠀⢠⣿⠀⣹⠃⢀⡟⠀⣼⠇⠀⣼⣿⣿⣿⣿⠁⢰⣿⣿⣿⣿⡆⢹⡇⠻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢦⡄⢹⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⣸⡟⠀⣿⠀⢸⠇⠀⠛⠀⢀⣿⣿⠟⣿⣿⠀⣿⣿⡏⣿⣿⣿⠀⠁⠀⠸⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡀⢻⡆⠀⠀⠀⠀⠀⠀⠀⠀⡄⣿⠃⠀⣿⠀⢸⡀⠀⠀⠀⠈⣿⣿⣷⣿⣿⠀⢿⣿⣷⣿⣿⠏⠀⠀⠀⠀⢷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣧⠈⢿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⢸⡀⠀⠀⠀⠀⠹⢿⣿⡿⠋⠀⠈⠻⠿⠟⠋⠀⠀⠀⠀⠀ ⢿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣆⠈⢿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡄⠸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀⠈⠳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣆⠀⠹⣇⣠⠀⠀⠀⠀⢄⠄⠀⣾⠻⣇⠀⢳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⢻⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢧⣴⠛⣿⣷⡠⠀⠀⣀⣤⡿⠁⠀⢿⡄⠘⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⣽⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢷⣯⠈⠛⠛⠟⠛⠁⠀⠀⠀⠈⢷⡄⠹⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    ⣰⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠳⣦⣄⠀⠀⠀⠀⠀⠀⠀⠈⢿⣄⠈⢷⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠀ ⢀⣴⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠳⣤⣀⠀⠀⠀⠀⠀⠀⠙⠻⢦⣝⣦⣄⣀⠀⠀⢰⣾⣷⣦⠀⠀ ⣀⣀⠴⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠙⠲⣦⣤⣤⣤⣤⣴⣞⠈⣉⣉⣛⣻⡿⠛⠟⠛⠚⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠈⠉⠙⠛⠛⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			time.sleep(2000);

			int damage = 0;
			object.checkHp();

			System.out.println("  너무 약한 짱구 달팽이는 " + damage + "의 피해를 입혔습니다.");
		} else if (cnt == 1) {
			System.out.println("  코끼리 변신!!!!");
			time.sleep(2000);
			System.out.println("\t ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ");
			System.out.println("\t⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⢀⣠⡤⠶⠖⠚⠛⠉⠉⠉⠛⠛⠒⠶⢤⣀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⣠⡴⠶⠛⠛⠉⠉⠛⠛⠛⠶⢤⣀⣠⢖⣯⣵⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠙⠲⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⢀⡴⠋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⢟⣴⣿⣿⣿⣿⣿⣷⡄⠀⠀⠀⠀⠀⠀⠀⣠⣴⣶⣦⣄ ⠈⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⣰⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡾⠁⢺⣿⡿⠋⠁⠈⠻⣿⠇⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣷⡄ ⠘⢦⠀⣀⣀⣀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⢰⠏⠀⠀⠀⠀⠀⠀⠀⠚⠛⠿⢶⣄⣾⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⠿⠋⠉⠙⣿⣿⣿⠀ ⠛⠋⠉⠉⠉⠉⠉⠙⠓⢦⣄⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⣠⡴⠛⠛⠛⢶⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  ⠈⠳⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⢿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⠀⢠⡾⠋⠀⠀⠀⠀⠀⠹⡆⠀⠀⠀⠀⠀⢀⣠⡶⠶⠛⠓⠶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀   ⠳⣄⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠘⢧⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠛⠀⠀⣀⣤⣴⣦⣄⠀⠁⠀⠀⠀⠀⢠⠟⠁⠀⠀⠀⠀⠀⠈⢷⠀⠀⠀⣠⠶⠚⠋⠛⠛⠛⠓⠶⣤⡀⠀⠀⠀⠘⣦⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠙⢦⣀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⣼⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⣤⣶⣿⣿⣷⣶⡀⠀⠀⠘⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠘⢧⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠙⣇⠀⠀⠀⠀⠀⠀⢠⡇⠀⠀⢸⣿⣿⣏⠀⣸⣿⣿⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⡆⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⢀⡾⠁⠀⠀⠈⠻⣿⣿⣿⣿⡿⠃⠀⠀⠀⠀⣿⣿⣿⠀⣨⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣷⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⢀⡟⠁⠀⠀⠀⠀⠀⣀⡄⠀⣀⣀⡀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡟⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⡏⠀⠀⠀⠀⣾⠃⠀⠀⠀⠀⣰⠞⠉⠀⠀⠀⠉⠉⠛⢶⡀⠀⠀⠈⠉⠛⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡼⠁⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠈⣿⠀⠀⠀⠀⣿⠀⠀⠀⢠⡾⠁⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡴⠋⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⢿⡀⠀⠀⠀⣿⡀⠀⢰⡟⠀⠴⠶⠶⠶⣤⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⠖⠚⠁⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠈⢷⣀⠀⠀⠸⣇⢠⡟⠀⠀⠀⠀⠀⠀⠀⠈⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡶⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠳⣤⣀⠹⣾⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⣿⡁⢠⠶⠶⢶⣤⡀⠀⠀⠀⠀⠀⣠⡶⠂⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⡴⠻⡆⠀⠀⠀⠀⠀⠀⠀⠀⣸⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⡆⠀⠀⠀⠀⠀⠙⠀⠀⠀⢠⣾⠋⠀⠀⠀⣀⣀⣀⣠⣤⠴⠖⠋⠁⠀⠀⠙⠦⣄⣀⠀⠀⠀⣀⠾⢹⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⣰⡟⠉⠙⠛⠛⠛⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⢙⡟⠁⠀⢸⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣷⠀⠀⠀⠀⠀⠀⠀⣰⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡞⠁⠀⠀ ⣾⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡄⠀⠀⠀⠀⠀⢠⡟⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⡾⠋⠀⠀⠀ ⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣷⠀⠀⠀⠀⠀⣾⠁⢿⣤⣤⣤⣤⣤⣤⣤⣤⣼⠀⠀⠀⠀⠀⠀⠀⠀⢰⡟⠁⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡟⢹⡆⠀⠀⠀⢰⡏⠀⢸⡇⢸⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀ ⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣧⡾⠃⠀⠀⠀⣾⠁⠀⠈⡇⠸⣟⣳⣖⣛⣞⣳⡏⠀⠀⠀⠀⠀⠀⠀⠀⢸⡗⣲⠚⢛⣶⠲⣦⢀⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡿⣧⣄⠀⠀⢰⡏⠀⠀⠀⣿⠀⠉⠉⠉⠉⠉⢹⡇⠀⠀⠀⠀⠀⠀⠀⠀⢸⡟⠋⠙⠉⠛⠛⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣇⠀⠙⠷⣴⠟⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠶⣶⢦⡤⠶⣄⠀⠀⢀⡏⠀⠀⠀⠀⠀⠀⢸⡷⠶⣤⡴⢦⡤⢤⡄⢀⣼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠚⠳⠾⠷⠶⠻⠶⠶⠛⠁⠀⠀⠀⠀⠀⠀⠈⠓⠒⠛⠶⠾⠳⠶⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			time.sleep(2000);

			int damage = minAtk + rd.nextInt(maxAtk - minAtk + 1);
			object.hp -= damage * 2;
			object.checkHp();

			System.out.println("  힘세고 강한 짱구 코끼리는 " + damage + "의 피해를 두번 입혔습니다.");
		} else if (cnt == 2) {
			System.out.println("  액션가면 변신!!!!");
			time.sleep(2000);
			System.out.println("\t     ⠀⠀⠀⠀⠀⠀⡷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t⠀  ⠀⠀⠀⠀⠀⠀⠀⠀⡇⠈⠳⣄⠀⠀⠀⠀⠀⠀⠀⢀⣏⡞⢳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t  ⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⢈⣧⣀⣀⣀⣀⣀⡀⡞⣸⠁⠸⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t  ⠀⠀⠀⠀⠀⠀⠀⠀⢀⡧⠔⠛⠉⠀⠀⠀⠀⠀⠀⠼⣡⠧⠤⢤⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t  ⠀⠀⠀⠀⠀⠀⠀⢀⣾⠔⢛⣉⣉⣛⣲⣄⠀⠀⠀⠀⠀⠀⠀⠀⠈⠓⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t  ⠀⠀⠀⠀⠀⠀⠀⡾⡎⠰⠋⢁⣠⣤⣬⣿⣦⠀⠀⣀⢤⣤⣤⣤⣀⠀⠀⠙⣦⠤⠤⠤⠤⣄⣀⣀⣀");
			System.out.println("\t  ⠀⠀⠀⠀⠀⠀⣸⠁⠹⣄⠀⣾⣿⠟⠛⣿⣿⡶⢫⣿⣿⣧⣤⡉⠙⢿⣦⡀⠘⣆⠀⠀⠀⠀⣀⠴⠚");
			System.out.println("\t  ⠀⠀⠀⢀⡴⠖⠓⠒⠢⠬⢷⣿⣿⣷⣾⡿⠟⣷⣿⣟⠉⢹⣿⣷⠀⠀⢷⡷⠀⢻⠀⣀⠴⠚⠁⠀⠀");
			System.out.println("\t  ⠀⠀⣰⠋⠀⠀⠀⠀⠀⠀⠀⠀⠉⠳⡄⠀⢀⣽⣿⣿⣿⣿⡿⠟⠀⣠⡼⠁⠀⠈⡟⠁⠀⠀⠀⠀⠀");
			System.out.println("\t  ⠀⢠⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠓⠋⠉⠀⠀⠈⠉⠛⠛⢭⣍⡀⠀⢀⣠⠔⠳⣄⠀⢀⣾⠀⠀");
			System.out.println("\t  ⠀⠈⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠑⠋⠀⠀⠀⣻⣄⡏⡟⠀⠀");
			System.out.println("\t  ⠀⠀⠘⣶⣀⠀⠀⠀⢠⠖⠋⠉⢳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⢀⣀⠀⠀⠀⠀⡟⣀⡼⠁⠀⠀");
			System.out.println("\t  ⠀⣠⠎⢸⠈⢩⠗⠒⣇⡀⢀⣠⠾⠴⠶⠶⠶⠖⣲⠖⠚⠉⠉⢯⠉⢹⠃⠉⣳⣶⠾⠋⠁⠀⠀⠀⠀");
			System.out.println("\t  ⡼⠁⠠⠼⣤⣋⡀⣴⠶⠿⣍⠙⠦⣀⣀⡤⠴⠋⠀⠀⠀⠀⠀⢸⢠⣏⡤⠞⠉⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t  ⠃⠀⠀⢰⢣⠏⠉⠁⠀⠀⢸⠀⠀⣼⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t  ⣆⠀⢀⣇⣼⠤⠾⣗⣦⣔⡧⠖⠛⠉⠓⠦⣄⣀⠀⠀⠀⣀⣀⣼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t  ⠈⠉⢩⠗⠒⠦⠤⠤⠤⡤⠚⠉⠉⠓⢦⣀⣀⣈⡩⠭⠭⠭⠔⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			System.out.println("\t  ⠀⠀⢸⠒⠦⠤⠤⣤⣸⡀⠀⠀⠀⠀⢸⠆⠀⠀⢀⣀⣀⣀⣠⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
			mp3.play(".//bgm//action_beam.mp3");
			time.sleep(3000);

			
			int damage = 9999;
			object.hp -= damage;
			object.checkHp();

			System.out.println("  액션 빔!!!! zzzzzzzz " + damage + "의 피해를 입혔습니다.");
		}

	}

	public void printRead() {
		System.out.println("\t\t\t" + name + "의 턴, 명령어 : " + read + " 실행");
	}

	
	public int getHpPotion() {
		return hpPotion;
	}
	
	public boolean isCheckShop(){return checkShop;}
	
}
